ent-CMBaseWeaponRifle = { ent-BaseItem }
    .desc = { ent-BaseItem.desc }
ent-WeaponRifleM54C = импульсная винтовка M54C
    .desc = Это стандартная импульсная винтовка, используемая колониальными морпехами. Надежное, прочное и в целом эффективное оружие, M54C необходимо держать двумя руками, чтобы вести точный огонь.
ent-WeaponRifleM54CE2 = тяжелая импульсная винтовка M54CE2
    .desc = Крупнокалиберное оружие поддержки отряда, способное вести длительный подавляющий огонь с навесной позиции. Несмотря на неустойчивость и меньшую точность, ее можно таскать и стрелять из нее двумя руками.
ent-WeaponRifleM4DMR = боевая винтовка M4DMR
    .desc = Боевая винтовка M4DMR - это винтовка для метких стрелков, состоящая на вооружении USCM. Боевая винтовка M4DMR, выполненная по схеме булл-пап, идеально подходит для разведки и огневой поддержки.
